// ※ 현재 프로젝트 작업 개요

// 목표 개발 날짜 11월 20일 

// 1. 민혁
// 아이템 착용
// 각 아이템 스탯 부여(몇 개만)
// 아이템 Hover UI(스탯) 

// 2. 성진
// 배경음 넣기
// 보스 스테이지 구현
// 슬라이더 바 UI 변경(이미지)
// 디졸브 이펙트

// 3. 창훈
// 메인 UI 수정
// 함정 애니메이션 추가
// 죽고 나서 처리(간단한 UI)
// 인게임 UI 수정
// 풋스템 사운드
// 피격 효과
// NPC(애니메이션 및 간단 텍스트) 
 
// 4. 재영
// 스테이지 레벨 디자인 수정
// 보스 스테이지 레벨 
// 메인 스테이지 레벨 


// 5. 정민
// 던전에 필요한 프랍 제작
// 메인에 있는 프랍 제작(간단하게)


// [추후 작업]
// 메인 UI(게임 시작, 설정, 데이터 로드 등)
// 인게임 UI (애니메이션 및 폰트 등)
// 피격 효과 추가
// 보스 스테이지
// 게임 밸런싱 패치(몬스터, 플레이어, 아이템, 스킬 등 쿨타임과 전체적인 스탯 관리)



// [버그]
// 화살 수정(피격 범위, 트레일)
// 플레이어 '절단' 스킬 피격 범위 


// [완료]
// 플레이어 스킬 시스템 구현(스킬 트리 및 스킬 흭득 방안 모색)
// 몬스터 VFX 효과 적용
// 무기 교체 시스템(인벤토리 무기 착용 후, 스테이지 진입 -> 무기 하나만 착용해도 입장 가능)
// 플레이어 스킬 입력 및 쿨타임 기능 정비
// 플레이어 스킬 VFX 효과 적용

