// ※ 현재 프로젝트 작업 개요



// [중요한 기능]
// 플레이어 스킬 시스템 구현(스킬 트리 및 스킬 흭득 방안 모색)
// 인게임 UI(체력 및 스킬, 아이템 바와 같은 UI) 적용 
// 클래스 선택(UI 수정)
// 메인 로비 시스템(아이템 판매, 구매, NPC 퀘스트) 
// 재화 시스템 개선
// 스테이지 구성 레벨 디자인
// 피격 효과 추가(피 튀기거나, 특정 VFX 효과 터지는 등)
// 보스 몬스터 구성(1페이즈 / 2페이즈 등)
// 몬스터 스킬 VFX 효과 적용(모든 몬스터)
// 프러스텀 컬링
// 배경음 및 UI 버튼 등 사운드 추가


// [나중에 작업할 기능]
// 스테이지 선택 UI(인게임)
// 메인 UI(게임 시작, 설정, 데이터 로드 등 + 애니메이션 적용)
// 게임 저장 및 로드
// 시네머신 연출 효과(보스 씬)
// 무기 교체 시스템(인벤토리 무기 착용 후, 스테이지 진입 -> 무기 하나만 착용해도 입장 가능)
// 튜토리얼 제작
// 게임 밸런싱 패치(몬스터, 플레이어, 아이템, 스킬 등 쿨타임과 전체적인 스탯 관리)
// UI 애니메이션(팝업 효과, 페이드인 & 아웃 등)



// [고쳐야 할 버그]
// 미노타 스킬 시 멀리서 플레이어가 맞는 버그?
// 몬스터 죽을 시 피격 당하지 않도록 막아야 함
// 화살 꽃히는 문제(없애는 걸로 생각 중)



// [기능 추가 완료]
// 몬스터 피격 시 데미지 텍스트 띄우기
// 플레이어 스킬 입력 및 쿨타임 기능 정비
// 지도 UGUI 추가

