// ※ 현재 프로젝트 작업 개요

// 게임 밸런싱 패치(몬스터, 플레이어, 아이템, 스킬 등 쿨타임과 전체적인 스탯 관리)
// UI 애니메이션(팝업 효과, 페이드인 & 아웃)


// [기능]
// 1. 민혁
// 메인 로비 시스템(아이템 구매 및 판매, 포탈 이동, NPC 퀘스트 등) + 재화 시스템 


// 2. 성진
// 보스 스테이지 기능


// 3. 창훈
// 플레이어 스킬 VFX 효과 적용
// 플레이어 스킬 시스템 구현(스킬 트리 및 스킬 흭득 방안 모색)
// 인게임 UI(체력 및 스킬, 아이템 바와 같은 UI) 적용
// 프러스텀 컬링



// 4. 재영
// 스테이지 및 로비 레벨 디자인


// 5. 정민



// [추후 작업]
// 메인 UI(게임 시작, 설정, 데이터 로드 등 + 애니메이션 적용)
// 피격 효과 추가
// 화살 사정거리 로직 수정
// 보스 스테이지 기획
// 배경음 및 UI 버튼 등 사운드 추가



// [버그]
// 미노타 박치기 스킬 멀리서 맞는 버그(가끔)
// 몬스터 죽는 애니메이션 재생 시 피격 맞지 않도록 설정
// 횃불 꺼졌다가 켜지는 현상(가끔)
// 투명벽 부드럽게 전환



// [완료]
// 몬스터 VFX 효과 적용
// 무기 교체 시스템(인벤토리 무기 착용 후, 스테이지 진입 -> 무기 하나만 착용해도 입장 가능)
// 플레이어 스킬 입력 및 쿨타임 기능 정비

