// ※ 현재 프로젝트 작업 개요


// [기능]
// 1. 민혁
// 아이템 장착 및 아이템 스탯 

// 2. 성진
// 보스 스테이지 기능

// 3. 창훈
// 인게임 UI(체력 및 스킬, 아이템 바와 같은 UI) 적용


// 4. 재영
// 스테이지 및 로비 레벨 디자인


// 5. 정민



// [추후 작업]
// 메인 UI(게임 시작, 설정, 데이터 로드 등)
// 인게임 UI (애니메이션 및 폰트 등)
// 피격 효과 추가
// 보스 스테이지
// 배경음 및 UI 사운드 
// 게임 밸런싱 패치(몬스터, 플레이어, 아이템, 스킬 등 쿨타임과 전체적인 스탯 관리)



// [버그]
// 화살 수정(피격 범위, 트레일)
// 플레이어 '절단' 스킬 피격 범위 
// 데미지 텍스트 최상단 레이어로 수정
// 



// [완료]
// 플레이어 스킬 시스템 구현(스킬 트리 및 스킬 흭득 방안 모색)
// 몬스터 VFX 효과 적용
// 무기 교체 시스템(인벤토리 무기 착용 후, 스테이지 진입 -> 무기 하나만 착용해도 입장 가능)
// 플레이어 스킬 입력 및 쿨타임 기능 정비
// 플레이어 스킬 VFX 효과 적용

