// ※ 현재 프로젝트 작업 개요

// 재화 시스템 개선
// 메인 로비 시스템(아이템 강화 및 합성 등)
// 몬스터 VFX 효과 적용(모든 몬스터)
// 보스 몬스터 공격 알고리즘 추가
// 메인 UI(게임 시작, 설정, 데이터 로드 등 + 애니메이션 적용)
// 스테이지 레벨 디자인
// UI 애니메이션(팝업 효과, 페이드인 & 아웃)
// 시네머신 연출 효과(보스 씬)
// 횃불 라이트 파티클 수정(+ 플리커 기능 추가)
// 환경광 및 포스트 프로세싱 화이트 밸런싱 조절
// 프러스텀 컬링
// 피격 효과 추가
// 배경음 및 UI 버튼 등 사운드 추가
// 무기 교체 시스템(인벤토리 무기 착용 후, 스테이지 진입 -> 무기 하나만 착용해도 입장 가능)
// 게임 밸런싱 패치(몬스터, 플레이어, 아이템, 스킬 등 쿨타임과 전체적인 스탯 관리)



// [중요한 기능]
// 플레이어 스킬 VFX 효과 적용
// 플레이어 스킬 시스템 구현(스킬 트리 및 스킬 흭득 방안 모색)
// 인게임 UI(체력 및 스킬, 아이템 바와 같은 UI) 적용



// [나중에 작업할 기능]



// [고쳐야 할 버그]
// 패시브 효과 두 개 적용 문제(쿨다운 겹침)



// [기능 추가 완료]
// 플레이어 스킬 입력 및 쿨타임 기능 정비

